app/controllers/chamados_controller.rb

SELECT * FROM `chamados` WHERE (chamado_status_id = 1)
---
	def index
		@chamados = Chamado.all(:conditions => ["chamado_status_id = ?", 1])

SELECT * FROM `chamados` WHERE (`chamados`.`id` = 1)
SELECT * FROM `chamado_tipos` WHERE (`chamado_tipos`.`id` = 1)
SELECT * FROM `chamado_statuses` WHERE (`chamado_statuses`.`id` = 1)
SELECT * FROM `responsabilidades` WHERE (chamado_id = 8 AND usuario_id = 1) LIMIT 1
---
	def show
		@chamado = Chamado.find(params[:id])
		@chamado_tipo = ChamadoTipos.find(@chamado.chamado_tipos_id)
		@chamado_status = ChamadoStatus.find(@chamado.chamado_status_id)
		@responsabilidade = Responsabilidade.first(:conditions => ["chamado_id = ?", @chamado.id])

SELECT * FROM `chamado_tipos`
---
	def new
    	@chamado = Chamado.new
    	@chamado_tipos = ChamadoTipos.all

INSERT INTO `chamados` (`created_at`, `updated_at`, `nome`, `coletivo`, `chamado_status_id`, `frente`, `descricao`, `chamado_tipos_id`) VALUES('2012-04-16 08:16:40', '2012-04-16 08:16:40', 'fjkwkqjb', 'kcjabckjwbq', 1, 'kjqwbckqjwb', 'içqbcqçwubcqiubciqwubicquwcç', 3)
---
  	def create
  		@chamado = Chamado.new(params[:chamado])

		if @chamado.save

SELECT * FROM `chamados` WHERE (`chamados`.`id` = 1)
SELECT * FROM `chamado_tipos`
---
  	def edit
  		@chamado = Chamado.find(params[:id])
  		@chamado_tipos = ChamadoTipos.all

SELECT * FROM `chamados` WHERE (`chamados`.`id` = 4)
UPDATE `chamados` SET `descricao` = 'Teste res', `updated_at` = '2012-04-17 04:19:15' WHERE `id` = 1
---
  	def update
  		@chamado = Chamado.find(params[:id])

    	if @chamado.update_attributes(params[:chamado])

SELECT * FROM `chamados` WHERE (`chamados`.`id` = 3)
SELECT * FROM `responsabilidades` WHERE (chamado_id = 17) LIMIT 1
DELETE FROM `chamados` WHERE `id` = 3
DELETE FROM `responsabilidades` WHERE `id` = 10
---
  	def destroy
	    @chamado = Chamado.find(params[:id])
	    @responsabilidade = Responsabilidade.first(:conditions => ["chamado_id = ?", @chamado.id])
	    @responsabilidade.destroy