app/controllers/home_controller.rb

SELECT * FROM `chamados` WHERE ((chamado_status_id = 1))
---
	def index
		@chamados = Chamado.all(:conditions => ["chamado_status_id = ?", 1])