app/controllers/responsabilidades_controller.rb

  def new
  	@responsabilidade = Responsabilidade.new
  	@responsabilidade.chamado = Chamado.find(params[:chamado_id])
  	@responsabilidade.usuario = @usuario_atual
  	@responsabilidade.inicio = Date.today

  	if @responsabilidade.save
---
SELECT * FROM `chamados` WHERE (`chamados`.`id` = 1)
INSERT INTO `responsabilidades` (`updated_at`, `saida`, `usuario_id`, `created_at`, `chamado_id`, `inicio`) VALUES('2012-04-17 21:12:55', NULL, 1, '2012-04-17 21:12:55', 17, '2012-04-17')