app/controllers/usuarios_controller.rb

SELECT * FROM `usuarios` ORDER BY nome
---
  def index
    @usuarios = Usuario.all(:order => 'nome')

SELECT * FROM `usuarios` WHERE (`usuarios`.`id` = 1)
---
  def show
    @usuario = Usuario.find(params[:id])

SELECT * FROM `usuarios` WHERE (`usuarios`.`id` = 1)
---
  def edit
    @usuario = Usuario.find(params[:id])

INSERT INTO `usuarios` (`created_at`, `nome`, `updated_at`, `usuario_tipos_id`, `login`, `senha`, `email`) VALUES('2011-11-15 19:52:47', 'Testículo', '2011-11-15 19:52:47', 2, 'teste', 'teste', 'teste@teste.com')
---
  def create
    @usuario = Usuario.new(params[:usuario])

    if @usuario.save

SELECT * FROM `usuarios` WHERE (`usuarios`.`id` = 1)
UPDATE `usuarios` SET `updated_at` = '2011-11-15 20:53:44', `adm` = 1 WHERE `id` = 1
---
  def update
    @usuario = Usuario.find(params[:id])

    if @usuario.update_attributes(params[:usuario])